
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        1 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                     |
|:--------:|:--------------------------------------------------------------|
|    🟢    | `module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost will be created
  + resource "aws_cloudwatch_metric_alarm" "periodic_cost" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:990466748045:cost-periodic-20241029191106708600000002",
        ]
      + alarm_name                            = "periodic_cost_Pb3CHg"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-990466748045"
        }
      + threshold                             = 18
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Currency" = "USD"
                }
              + metric_name = "EstimatedCharges"
              + namespace   = "AWS/Billing"
              + period      = 86400
              + stat        = "Maximum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "RATE(m1) * 1 * 24 * 3600"
          + id          = "e1"
          + label       = "Daily cost"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>